{
  "tvShow": [
    {
      "tvShowId": "T1",
      "tvShowName": "Game of Thrones",
      "tvShowRelease": "April 17, 2011",
      "tvShowRate": "Rating: 9.3/10 · ‎1,796,962 votes",
      "tvShowDescription": "Game of Throne bisa dibilang sebagai tv series terbaik dalam satu dekade terakhir. Hal itu dirasa tidak berlebihan, karena tv series garapan David Bennioff dan D.B. Weiss sukses merebut perhatian jutaan orang di seluruh dunia. Terbukti serial tv ini sukses mendapatkan rating tertinggi di situs IMDB, yaitu 9,5.",
      "tvShowGenre": "Serial, Epic, Tragedy, Action, Fantasy television, Action fiction, Drama, Suspense, Medieval fantasy, Thriller, Adventure, Special Interest",
      "tvShowLocation": "Northern Ireland Dan Iceland",
      "tvShowTotalEpisode": "73 Episode",
      "imagePath": "https://s4.bukalapak.com/uploads/content_attachment/9ef1d7fc30e8d7627da004c5/w-744/tv_series_terbaik_-1.jpg"
    },
    {
      "tvShowId": "T2",
      "tvShowName": "Run On",
      "tvShowRelease": "December 16, 2020",
      "tvShowRate": "Rating: 7.6/10 · ‎1,110 votes",
      "tvShowDescription": "Run On yang dibintangi oleh Im Si-wan, Shin Se-kyung, Sooyoung SNSD, dan Kang Tae Oh, bercerita tentang orang-orang yang mencoba terhubung satu sama lain dalam bahasa mereka sendiri setelah hidup di dunia yang berbeda dengan kecepatan yang berbeda. Sorotan utamanya adalah kisah cinta antara Ki Seon Gyeom (Im Si-wan) dan Oh Mi Joo (Shin Se-kyung). Ki Seon Gyeom dulunya adalah pelari sprint terkenal untuk tim nasional tapi harus mengakhiri kariernya karena sebuah kasus. Ia kemudian alih profesi sebagai agen olahraga. Sementara, Oh Mi Joo bekerja sebagai penerjemah subtitle film yang sangat bangga dengan pekerjaannya. Pada suatu momen, Oh Mi Joo bertemu dengan Ki Seon Gyeom dan langsung yakin kalau pertemuan mereka adalah awal dari sebuah takdir.",
      "tvShowGenre": "Drama, Sports, Romance, Life",
      "tvShowLocation": "Korea Selatan",
      "tvShowTotalEpisode": "16 Episode",
      "imagePath": "https://cdn-2.tstatic.net/tribunnewswiki/foto/bank/images/drama-run-on.jpg"
    },
    {
      "tvShowId": "T3",
      "tvShowName": "Find Me in Your Memory",
      "tvShowRelease": "March 18, 2020",
      "tvShowRate": "Rating: 7.4/10 · ‎394 votes",
      "tvShowDescription": "Kim Dong Wook, sebagai lead actor, emang sudah lebih senior di dunia akting. Saya sih nggak meragukan kemampuan aktingnya. Ahjussi ini sudah membuktikan kualitas aktingnya dengan mencoba berbagai peran di drama dan film. Sejauh ini tak ada yang mengecewakan. Yang bikin saya rada khawatir sebenarnya justru lead actress Find Me in Your Memory, Moon Ga Young. Terakhir, saya melihat aktingnya di Welcome to Waikiki 2. Jujur saja, aktingnya di drama komedi itu nggak terlalu mengesankan. Walau juga nggak bisa dibilang buruk. Yah, standar aja sih. Terlepas dari keraguan tentang chemistry dan kualitas akting aktor-aktornya, Find Me in Your Memory mengangkat isu yang, boleh dibilang, masih jarang dibicarakan publik yaitu hyperthymesia.",
      "tvShowGenre": "Korean Drama, Drama, Mystery",
      "tvShowLocation": "Korea Selatan",
      "tvShowTotalEpisode": "16 Episode",
      "imagePath": "https://asset.kompas.com/crops/Tj7nIE_jdTc3xix20W6TxzRaEb8=/108x568:972x1144/750x500/data/photo/2020/04/06/5e8aa8d01f126.jpg"
    },
    {
      "tvShowId": "T4",
      "tvShowName": "The 100",
      "tvShowRelease": "March 19, 2014",
      "tvShowRate": "Rating: 7.6/10 · ‎220,312 votes",
      "tvShowDescription": "Mengambil masa hampir 100 tahun setelah perang nuklir yang menyapu hampir seluruh kehidupan di Bumi, episode pertama ‘The 100’ dibuka dengan ditegakkannya hukum yang berlaku di Ark – sebuah stasiun luar angkasa yang merupakan gabungan beberapa stasiun luar angkasa dari berbagai negara.  Ark adalah tempat tinggal sementara di luar angkasa bagi penduduk Bumi yang selamat dari bencana radiasi nuklir – sebelum mereka bisa kembali ke Bumi. Hukum yang berlaku di Ark sangat keras.  Sekecil apapun kesalahan, hukumannya adalah mati dengan cara dibuang ke luar angkasa. Hukum dijalankan atas persetujuan kanselir, karena itu kanselir sangat dibenci penduduk Ark. Suatu hari, Ark mengirim 100 tahanan remaja ke Bumi.  Bagi sebagian tahanan, pengiriman ini berarti pembuangan, bagi sebagian yang lain berarti kesempatan. Bagi Ark, pengiriman ini untuk mencari tahu apakah permukaan Bumi sudah bisa dihuni kembali atau tidak – karena kondisi Ark semakin kritis. Dari sinilah semuanya bermula karena Bumi saat itu ternyata tidak hanya indah namun sangat berbahaya, bahkan mematikan.",
      "tvShowGenre": "Science Fiction Drama",
      "tvShowLocation": "Vancouver, British Columbia",
      "tvShowTotalEpisode": "100 Episode",
      "imagePath": "https://i.pinimg.com/originals/29/70/d2/2970d2d96ab208bb04148f30db7d3a7f.jpg"
    },
    {
      "tvShowId": "T5",
      "tvShowName": "Hello, Me!",
      "tvShowRelease": "February 17, 2021",
      "tvShowRate": "Rating: 7.3/10 · ‎157 votes",
      "tvShowDescription": "Drama Korea \"Hello, Me!\" menjadi salah satu drama terbaru yang ditayangkan pada bulan Februari 2021. Drama ini memiliki jalan cerita yang menarik tentang Bahn Ha-Ni (Lee Re) yang berumur 17 tahun melakukan perjalanan waktu hingga bertemu dengan Bahn Ha-Ni (Choi Kang-Hee) yang berumur 34 tahun. Drama ini memiliki tema Romance-Comedy dengan tema perjalanan waktu sehingga juga bersaing secara langsung dengan \"Sisyphus, The Myth\" karena memiliki tema serupa (perjalanan waktu) dan waktu penayangan yang sama. Bahn Ha-Ni muda (Lee Re) memiliki personality yang ceria dan bersemangat karena dia sangat populer di sekolahnya. Cukup banyak talenta yang dimilikinya seperti menari dan akting sehingga banyak temannya menyukai Bahn Ha-Ni. Karakter ini sangatlah berbeda dengan Bahn Ha-Ni dewasa (Choi Kang-Hee) yang memiliki perasaan pesimis. Ketika pertama kali bertemu dia bekerja sebagai cumi-cumi di supermarket untuk Joa Confectionary.",
      "tvShowGenre": "Drama, Romantic Comedy, Fantasy Television",
      "tvShowLocation": "Korea Selatan",
      "tvShowTotalEpisode": "16 Episode",
      "imagePath": "https://cdn-2.tstatic.net/jateng/foto/bank/images/hello-me.jpg"
    },
    {
      "tvShowId": "T6",
      "tvShowName": "The Umbrella Academy",
      "tvShowRelease": "April 17, 2011",
      "tvShowRate": "Rating: 8/10 · ‎164,791 votes",
      "tvShowDescription": "Seri komik The Umbrella Academy terdiri dari 6 buku, kemudian sekuelnya “Dallas” juga sepanjang 6 buku, dan paling baru “Hotel Oblivion” dirilis sepanjang 7 buku. Semuanya dipublikasikan oleh Dark Horse Comics. Nah, serial Netflix-nya mengambil jalan cerita seri pertama dari komik. Premis Utama (Non Spoiler) Tanggal 1 oktober 1989, tiba-tiba puluhan wanita di seluruh penjuru dunia melahirkan tanpa mengalami proses kehamilan sebelumnya. Bilyuner Sir Reginald Hargreeves (Colm Feore) buru-buru mengadopsi sebanyak mungkin anak-anak tersebut dan tidak lupa memberi uang pesangon bagi orang tua dengan jumlah yang sangat besar. Reginald kemudian merawat dan membesarkan anak-anak itu untuk menjadi sebuah tim superhero, karena ternyata, semua anak punya kekuatan super. Begitulah The Umbrella Academy terbentuk. Sepintas konsepnya mirip X-Men. ",
      "tvShowGenre": "Action, Adventure",
      "tvShowLocation": "Toronto",
      "tvShowTotalEpisode": "20 Episode",
      "imagePath": "https://beritakini.co/files/images/20201115-the-umbrella-academy.jpg"
    },
    {
      "tvShowId": "T7",
      "tvShowName": "18 Again",
      "tvShowRelease": "September 21, 2020",
      "tvShowRate":  "Rating: 8.2/10 · ‎723 votes",
      "tvShowDescription": "Jung Da-jung ( Ha Neul) dan Hong Dae-young (Yoon Sang Hyun), pasangan suami istri yang telah menikah selama lebih dari 18 tahun. Pernikahan mereka kini di ambang perpisahan. Keduanya berada pada titik jenuh. Kehidupan pernikahan ternyata tak seindah yang dibayangkan, dan bukan hal yang mudah untuk dijalani. Apalagi Da Jung dan Dae Young menikah di usia yang sangat muda, 18 tahun. Karena pernikahan itu, banyak impian masa muda yang harus dikorbankan. Da Jung yang dulu bercita-cita jadi penyiar harus menangguhkan pendidikan karena fokus mengurus dua anak kembar mereka. Sementara Dae Young, seorang ace di tim basket sekolah dengan masa depan cerah, juga harus mengubur impian jadi pemain basket professional. Ia harus banting tulang, kerja serabutan untuk memberi makan keluarga. ",
      "tvShowGenre": "Drama, Coming-of-age Story, Fantasy Television",
      "tvShowLocation": "Korea Selatan",
      "tvShowTotalEpisode": "16 Episode",
      "imagePath": "https://cdn.idntimes.com/content-images/post/20201027/nonton-18-again-1-83935f5adcac7c519c243203713e2ca1_600x400.png"
    },
    {
      "tvShowId": "T8",
      "tvShowName": "Let's Go Luna",
      "tvShowRelease": "April 17, 2011",
      "tvShowRate": "Rating: 7.3/10 · ‎114 votes",
      "tvShowDescription": "Leo si wombat, Carmen si kupu-kupu, dan Andy si katak berkeliling dunia untuk belajar tentang budaya bersama teman mereka, Luna the moon.",
      "tvShowGenre": "Animation, Comedy, Family",
      "tvShowLocation": "Mexico City, Mexico. Moscow, Russia. Cairo, Egypt. Beijing, China. London, England. Delhi, India. Sydney, Australia. Tokyo, Japan.",
      "tvShowTotalEpisode": "45 Episode",
      "imagePath": "https://cms-tc.pbskids.org/luna/featured-video.jpg?mtime=20181108172809"
    },
    {
      "tvShowId": "T9",
      "tvShowName": "Extracurricular",
      "tvShowRelease": "April 29, 2020",
      "tvShowRate": "Rating: 7.7/10 · ‎3,046 votes",
      "tvShowDescription": "Pasalnya premis yang digunakan dalam serial ini terbilang segar. Oh Ji Soo (Kim Dong Hee) adalah seorang anak broken home yang belajar di sekolah swasta ternama di Korea. Ji Soo dikenal sebagai murid teladan dengan nilai di atas rata-rata. Tapi di balik kehidupan remajanya yang terbilang biasa, dia menjadi otak di balik penyedia layanan keamanan untuk pelaku prostitusi. Salah satu pelaku prostitusi yang ia damping adalah Seo Min Hee (Jung Da Bin), teman satu kelasnya. Berasal dari keluarga berada, dia melakukannya agar bisa membelikan barang-barang untuk pacarnya, Gwak Gi Tae (Nam Yoon Soo). Tapi pekerjaan Ji Soo diketahui oleh salah satu anak populer di kelasnya, Bae Gyu Ri (Park Joo Hyun). Dan kehidupan Ji Soo berubah.",
      "tvShowGenre": "Drama, Crime Film",
      "tvShowLocation": "Korea Selatan",
      "tvShowTotalEpisode": "10 Episode",
      "imagePath": "https://i2.wp.com/mariviu.com/wp-content/uploads/2020/05/Extracurricular-netflix-review.jpg?fit=665%2C374&ssl=1"
    },
    {
      "tvShowId": "T10",
      "tvShowName": "GTO: Great Teacher Onizuka",
      "tvShowRelease": "July 7, 1998",
      "tvShowRate": "Rating: 8.7/10 · ‎293,556 votes",
      "tvShowDescription": "Eikichi Onizuka, 22 tahun, adalah mantan pemimpin geng bermotor yang tidak tahu apa yang dilakukan dalam hidupnya. Dia bertemu seorang gadis yang mengobarkan keinginannya untuk menjadi seorang guru. Onizuka berhasil menjadi guru di kemudian hari, tetapi Onizuka tidaklah sama dengan guru-guru yang sudah ada.",
      "tvShowGenre": "Action Fiction, Yankee, Comedy",
      "tvShowLocation": "Jepang",
      "tvShowTotalEpisode": "12 Episode",
      "imagePath": "https://3.bp.blogspot.com/-mkvWrEW9IRU/WVt5xj-XEJI/AAAAAAAADPQ/AhVPDkhwPUo5-lblRRsvS0BcOpMvprN7ACLcBGAs/s1600/GTO_2014-p02.jpg"
    }
  ]
}